Tekla Open API Reference for Tekla Structures 2025
Filter Constructor
Overload List
Name | Description
Filter(FilterExpression)
 Initializes a new instance of the Filter class.
Filter(String, IFormatProvider)
 Initializes a new instance of the Filter class.
Top
See Also
Reference
Filter Class
Tekla.Structures.Filtering Namespace